<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Carbon;
use Illuminate\Support\Facades\DB;

class UkraineRegionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        foreach ($this->data() as $value) {
            DB::table('ukraine_regions')->insert($value);
        }
    }

    protected function data()
    {
        $data = [];

        foreach ($this->regions() as $key => $region) {
            $data[] = [
                'id' => $key,
                'name_ru' => $region[0],
                'name_ua' => $region[1],
                'status' => 1,
                'created_at' => Carbon::now()->format('Y-m-d H:i:s'),
                'updated_at' => Carbon::now()->format('Y-m-d H:i:s'),
            ];
        }

        return $data;
    }

    protected function regions()
    {
        return [
            279 => [
                'Винницкая обл.',
                'Вінницька область'
            ], 280 => [
                'Волынская обл.',
                'Волинська область'
            ], 281 => [
                'Днепропетровская обл.',
                'Дніпропетровська область'
            ], 282 => [
                'Донецкая обл.',
                'Донецька область'
            ], 283 => [
                'Житомирская обл.',
                'Житомирська область'
            ], 284 => [
                'Закарпатская обл.',
                'Закарпатська область'
            ], 285 => [
                'Запорожская обл.',
                'Запорізька область'
            ], 286 => [
                'Ивано-Франковская обл.',
                'Івано-Франківська область'
            ], 287 => [
                'Киевская обл.',
                'Київська область'
            ], 288 => [
                'Кировоградская обл.',
                'Кіровоградська область'
            ], 289 => [
                'АР Крым',
                'АР Крим',
            ], 290 => [
                'Луганская обл.',
                'Луганська область',
            ], 291 => [
                'Львовская обл.',
                'Львівська область',
            ], 292 => [
                'Николаевская обл.',
                'Миколаївська область',
            ], 293 => [
                'Одесская обл.',
                'Одеська область',
            ], 294 => [
                'Полтавская обл.',
                'Полтавська область',
            ], 295 => [
                'Ровенская обл.',
                'Рівненська область',
            ], 296 => [
                'Сумская обл.',
                'Сумська область',
            ], 297 => [
                'Тернопольская обл.',
                'Тернопільська область',
            ], 298 => [
                'Харьковская обл.',
                'Харківська область',
            ], 299 => [
                'Херсонская обл.',
                'Херсонська область',
            ], 300 => [
                'Хмельницкая обл.',
                'Хмельницька область',
            ], 301 => [
                'Черкасская обл.',
                'Черкаська область',
            ], 302 => [
                'Черниговская обл.',
                'Чернігівська область',
            ], 303 => [
                'Черновицкая обл.',
                'Чернівецька область',
            ],
        ];
    }
}
